___

<a href='http://www.pieriandata.com'> <img src='../../Pierian_Data_Logo.png' /></a>
___

# SF Salaries Exercise

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

** Import pandas as pd.**

In [18]:
import pandas as pd
import numpy as np

** Read Salaries.csv as a dataframe called sal.**

In [19]:
df = pd.read_csv("sal.csv")

** Check the head of the DataFrame. **

In [20]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [22]:
df.columns.tolist()

['Id',
 'EmployeeName',
 'JobTitle',
 'BasePay',
 'OvertimePay',
 'OtherPay',
 'Benefits',
 'TotalPay',
 'TotalPayBenefits',
 'Year',
 'Notes',
 'Agency',
 'Status']

**What is the average BasePay ?**

In [23]:
# 66325.44884050643
df['BasePay'] = pd.to_numeric(df['BasePay'], errors='coerce')
np.nanmean(df["BasePay"])

66325.4488404877

** What is the highest amount of OvertimePay in the dataset ? **

In [24]:
# 245131.88
df["OvertimePay"] = pd.to_numeric(df["OvertimePay"], errors="coerce")
np.nanmax(df["OvertimePay"])

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [25]:
# 24    CAPTAIN, FIRE SUPPRESSION
# Name: JobTitle, dtype: object
df[df["EmployeeName"] == "JOSEPH DRISCOLL"]["JobTitle"]

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [26]:
df[df["EmployeeName"] == "JOSEPH DRISCOLL"]["TotalPayBenefits"]

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?**

In [27]:
df["TotalPayBenefits"] = pd.to_numeric(df["TotalPayBenefits"], errors="coerce")
max_value = np.nanmax(df["TotalPayBenefits"])
df[df["TotalPayBenefits"] == max_value]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [28]:
min_value = np.nanmin(df["TotalPayBenefits"])
df[df["TotalPayBenefits"] == min_value]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [29]:
# Year
# 2011    63595.956517
# 2012    65436.406857
# 2013    69630.030216
# 2014    66564.421924
# Name: BasePay, dtype: float64

df.groupby("Year")["BasePay"].mean().reset_index()

   Year       BasePay
0  2011  63595.956517
1  2012  65436.406857
2  2013  69630.030216
3  2014  66564.421924

** How many unique job titles are there? **

In [30]:
len(df["JobTitle"].unique().tolist()) or df["JobTitle"].nunique()

2159

** What are the top 5 most common jobs? **

In [31]:
df_grouped_by_jobtitle = df["JobTitle"].value_counts()
df_grouped_by_jobtitle.head(5)

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [32]:
unique_job_titles_at_2013 = df[df['Year'] == 2013]['JobTitle'].value_counts()
job_titles_with_one_person = unique_job_titles_at_2013[unique_job_titles_at_2013 == 1]
job_titles_with_one_person.count()

202

** How many people have the word Chief in their job title? (This is pretty tricky) **

In [33]:
# 477
df["EmployeeName"] = df["EmployeeName"].str.upper()
contains_chief = df[df["JobTitle"].str.contains("Chief", case=False)]
contains_chief_count = contains_chief["EmployeeName"].nunique()
contains_chief_count

392

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

In [34]:
df["title_len"] = df["JobTitle"].str.len()
correlation = df[["title_len", "TotalPayBenefits"]].corr()
correlation

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

# Great Job!